#include <iostream>

using namespace std;

int main() {
    // 빠른 입출력
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int h, m, s;
    cin >> h >> m >> s;

    int q;
    cin >> q;

    int T, c;
    int move_h, move_m, move_s; // 더하거나 뺄 시간
    int carry; // 올림 or 내림을 위함
    int tmp; // 임시 값
    while (q--) {
        cin >> T;

        if (T == 1 || T == 2) {
            cin >> c;

            c %= 86400; // 24 * 60 * 60으로 나머지 연산을 하여 돌려야 할 시간을 24시간 내로 만듦 
            move_h = c / 3600; // 60 * 60으로 나눈 몫
            c %= 3600; // 60 * 60으로 나머지 연산을 하여 돌려야 할 시간을 1시간 내로 만듦
            move_m = c / 60; // 60으로 나눈 몫
            c %= 60; // 60으로 나머지 연산을 하여 돌려야 할 시간을 1분 내로 만듦
            move_s = c;

            if (T == 1) {
                // 올림을 고려하여 초, 분, 시간 단위로 계산
                tmp = s + move_s; // 현재 초에 움직일 초를 더함
                carry = tmp / 60; // 60보다 클 경우 올림 연산을 위해 저장
                s = tmp % 60; // 60으로 나머지 연산을 하여 돌려야 할 시간을 1분 내로 만듦

                tmp = m + move_m + carry; // 현재 분에 움직일 분과 올림된 분을 더함
                carry = tmp / 60; // 60보다 클 경우 올림 연산을 위해 저장
                m = tmp % 60; // 60으로 나머지 연산을 하여 돌려야 할 시간을 1시간 내로 만듦

                tmp = h + move_h + carry; // 현재 시간에 움직일 시간과 올림된 시간을 더함
                h = tmp % 24; // 24로 나머지 연산을 하여 돌려야 할 시간을 하루 내로 만듦
            }
            else {
                // 내림을 고려하여 초, 분, 시간 단위로 계산
                tmp = s - move_s + 60; // 현재 초에 움직일 초를 뺌, 60을 더하는 이유는 나머지 연산(%)은 양수에 대해서만 적용되기 때문
                if (tmp < 60) carry = 1; // 60을 더했는데도 60보다 작을 경우 내림 연산을 위해 저장
                else carry = 0;
                s = tmp % 60; // 60으로 나머지 연산을 하여 돌려야 할 시간을 1분 내로 만듦

                tmp = m - move_m - carry + 60; // 현재 분에 움직일 분과 내림된 분을 뺌, 60을 더하는 이유는 나머지 연산(%)은 양수에 대해서만 적용되기 때문
                if (tmp < 60) carry = 1; // 60을 더했는데도 60보다 작을 경우 내림 연산을 위해 저장
                else carry = 0;
                m = tmp % 60; // 60으로 나머지 연산을 하여 돌려야 할 시간을 1시간 내로 만듦

                tmp = h - move_h - carry + 24; // 현재 분에 움직일 시간과 내림된 시간을 뺌, 24를 더하는 이유는 나머지 연산(%)은 양수에 대해서만 적용되기 때문
                h = tmp % 24; // 24로 나머지 연산을 하여 돌려야 할 시간을 하루 내로 만듦
            }    
        }
        else {
            cout << h << " " << m << " " << s << "\n";
        }
    }
}